src/test/resources/json_body/Tax_post_ship.json

{"invoices":[{"invoiceId":"azxvFXFx8w","invoiceDate":"2020-09-10","currency":"USD","transactionType":"GS","custName":"FirstName LastName","custNumber":"000","shipTo":{"address1":"Sstreet","city":"Seattle","country":"USA","postcode":"98195","state":"WA"},"billTo":{"address1":"Bstreet","city":"Seattle","country":"USA","postcode":"98195","state":"WA"},"lineItems":[{"lineNumber":1,"productCode":"KPPD-IND","unitPrice":399.0,"quantity":1,"total":399.0,"shipTo":{"address1":"Sstreet","city":"Seattle","country":"USA","postcode":"98195","state":"WA"},"vatId":""}]}],"source":"NEJMCDF"}